lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/EdgeComm/edge_comm.c
static uint8_t g_ai_reported_class = 0U;
static uint8_t g_ai_fault_code_initialized = 0U;

static uint8_t ESP_AI_SelectReportedClass(const EdgeWind_AI_Result_t *result)
{
    if (result == NULL)
    {
        return g_ai_reported_class;
    }

    if ((result->class_id >= EDGEWIND_AI_CLASS_COUNT) ||
        (result->confidence < EDGEWIND_AI_CONFIDENCE_MIN))
    {
        g_ai_reported_class = 0U;
        return g_ai_reported_class;
    }

    g_ai_reported_class = result->class_id;
    return g_ai_reported_class;
}

static void ESP_AI_UpdateFaultCode(const float analog_v[4][AD_ACQ_POINTS])
{
    static uint32_t last_ai_log_tick = 0U;
    static uint32_t last_ai_run_tick = 0U;
    EdgeWind_AI_Result_t result;
    int ret;
    uint8_t reported_class;
    const char *reported_code;
    uint32_t now_tick = HAL_GetTick();

    if (g_ai_fault_code_initialized != 0U &&
        EDGEWIND_AI_RUN_INTERVAL_MS > 0U &&
        (uint32_t)(now_tick - last_ai_run_tick) < EDGEWIND_AI_RUN_INTERVAL_MS)
    {
        return;
    }
    last_ai_run_tick = now_tick;

    ret = EdgeWind_AI_RunOnAnalogWindow(analog_v, &result);
    if (ret != 0)
    {
        if ((uint32_t)(now_tick - last_ai_log_tick) >= 2000U)
        {
            last_ai_log_tick = now_tick;
            ESP_Log("[AI] runtime error ret=%d; keep fault=%s\r\n", ret, g_fault_code);
        }
        return;
    }

    reported_class = ESP_AI_SelectReportedClass(&result);
    reported_code = EdgeWind_AI_ClassCode(reported_class);
    if ((g_ai_fault_code_initialized == 0U) || (strncmp(g_fault_code, reported_code, 3U) != 0))
    {
        strncpy(g_fault_code, reported_code, sizeof(g_fault_code) - 1U);
        g_fault_code[sizeof(g_fault_code) - 1U] = '\0';
        ESP_Log("[AI] fault_code updated: %s\r\n", g_fault_code);
        g_ai_fault_code_initialized = 1U;
    }

    if ((uint32_t)(now_tick - last_ai_log_tick) >= 2000U)
    {
        last_ai_log_tick = now_tick;
        ESP_Log("[AI] pred=%s/%s conf=%d.%03d report=%s feat=%lums infer=%lums total=%lums\r\n",
                result.fault_code,
                EdgeWind_AI_ClassName(result.class_id),
                (int)result.confidence,
                (int)((result.confidence - (float)((int)result.confidence)) * 1000.0f),
                reported_code,
                (unsigned long)result.feature_ms,
                (unsigned long)result.inference_ms,
                (unsigned long)result.total_ms);
    }
}

static bool ESP_AcquisitionWindowAllZero(float (*src)[WAVEFORM_POINTS])
{
    if (src == NULL)
    {
        return false;
    }

    for (uint8_t ch = 0U; ch < 4U; ch++)
    {
        for (int i = 0; i < WAVEFORM_POINTS; i++)
        {
            if (src[ch][i] != 0.0f)
            {
                return false;
            }
        }
    }
    return true;
}

#ifndef AXI_SRAM_SECTION
#define AXI_SRAM_SECTION __attribute__((section(".axi_sram")))
#endif

Channel_Data_t node_channels[4] AXI_SRAM_SECTION;
volatile uint8_t g_esp_ready = 0U;
static volatile uint8_t g_report_enabled = 0U;
static volatile uint8_t g_ui_wifi_ok = 0U;
static volatile uint8_t g_ui_tcp_ok = 0U;
static volatile uint8_t g_ui_reg_ok = 0U;
static volatile uint8_t g_ui_auto_recover_pending = 0U;
static volatile uint8_t g_ui_auto_recover_want_report = 0U;
static uint32_t g_ui_auto_recover_next_poll_tick = 0U;
static uint32_t g_ui_auto_recover_next_attempt_tick = 0U;
static uint32_t g_ui_last_session_epoch = 0U;
static uint8_t g_ui_last_session_valid = 0U;

static SystemConfig_t g_sys_cfg;
static uint8_t g_sys_cfg_loaded = 0U;

static arm_rfft_fast_instance_f32 S;
static uint8_t fft_initialized = 0U;
static uint8_t channels_metadata_initialized = 0U;
static float32_t fft_input_buf[WAVEFORM_POINTS] AXI_SRAM_SECTION;
static float32_t fft_output_buf[WAVEFORM_POINTS] AXI_SRAM_SECTION;
static float32_t fft_mag_buf[WAVEFORM_POINTS] AXI_SRAM_SECTION;

static inline void ESP_RtosYield(void)
{
    if ((osKernelGetState() == osKernelRunning) && (__get_IPSR() == 0U))
    {
        osDelay(1);
    }
}

static void ESP_LoadConfig(void)
{
    if (g_sys_cfg_loaded)
    {
        return;
    }

    SD_Config_SetDefaults(&g_sys_cfg);
    g_sys_cfg_loaded = 1U;
}

const SystemConfig_t *ESP_Config_Get(void)
{
    if (!g_sys_cfg_loaded)
    {
        ESP_LoadConfig();
    }
    return &g_sys_cfg;
}

void ESP_Config_Apply(const SystemConfig_t *cfg)
{
    if (cfg == NULL)
    {
        return;
    }
    g_sys_cfg = *cfg;
    g_sys_cfg_loaded = 1U;
}

static void ESP_Init_Channels_And_DSP(void)
{
    if (!fft_initialized)
    {
        arm_rfft_fast_init_f32(&S, WAVEFORM_POINTS);
        fft_initialized = 1U;
    }

    if (channels_metadata_initialized)
    {
        return;
    }

    memset(node_channels, 0, sizeof(node_channels));
    node_channels[0].id = 0;
    strncpy(node_channels[0].label, "直流母线(+)", sizeof(node_channels[0].label) - 1U);
    strncpy(node_channels[0].unit, "V", sizeof(node_channels[0].unit) - 1U);

    node_channels[1].id = 1;
    strncpy(node_channels[1].label, "直流母线(-)", sizeof(node_channels[1].label) - 1U);
    strncpy(node_channels[1].unit, "V", sizeof(node_channels[1].unit) - 1U);

    node_channels[2].id = 2;
    strncpy(node_channels[2].label, "负载电流", sizeof(node_channels[2].label) - 1U);
    strncpy(node_channels[2].unit, "A", sizeof(node_channels[2].unit) - 1U);

    node_channels[3].id = 3;
    strncpy(node_channels[3].label, "漏电流", sizeof(node_channels[3].label) - 1U);
    strncpy(node_channels[3].unit, "mA", sizeof(node_channels[3].unit) - 1U);

    channels_metadata_initialized = 1U;
}

#if (ESP_UPLOAD_SNAPSHOT_SLOT_COUNT < 2)
#error "ESP_UPLOAD_SNAPSHOT_SLOT_COUNT must be at least 2"
#endif

#define ESP_UPLOAD_SNAPSHOT_MAGIC      0x45575550UL /* "EWUP" */
#define ESP_UPLOAD_SNAPSHOT_SDRAM_ADDR ((uintptr_t)0xC0680000UL)

typedef struct
{
    uint32_t magic;
    uint32_t seq;
    uint32_t tick_ms;
    uint8_t ready_buffer;
    uint8_t channel_count;
    uint8_t report_mode;
    uint8_t status_code;
    char fault_code[8];
    esp32_spi_report_channel_t channels[4];
    float current_value[4];
    float waveform[4][WAVEFORM_POINTS];
    float fft_data[4][FFT_POINTS];
} ESP_UploadSnapshot_t;

static ESP_UploadSnapshot_t * const g_upload_snapshots =
    (ESP_UploadSnapshot_t *)ESP_UPLOAD_SNAPSHOT_SDRAM_ADDR;
static volatile int8_t g_upload_snapshot_latest_idx = -1;
static volatile int8_t g_upload_snapshot_inflight_idx = -1;
static volatile int8_t g_upload_snapshot_writing_idx = -1;
static volatile uint8_t g_upload_snapshot_next_idx = 0U;
static volatile uint32_t g_upload_snapshot_seq = 0U;
static volatile uint32_t g_upload_snapshot_publish_count = 0U;
static volatile uint32_t g_upload_snapshot_drop_count = 0U;

static int8_t ESP_UploadSnapshot_BeginWrite(void)
{
    int8_t idx;

