lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/EdgeComm/edge_comm.c
    taskENTER_CRITICAL();
    idx = (int8_t)(g_upload_snapshot_next_idx % ESP_UPLOAD_SNAPSHOT_SLOT_COUNT);
    if (idx == g_upload_snapshot_inflight_idx)
    {
        idx = (int8_t)((idx + 1) % ESP_UPLOAD_SNAPSHOT_SLOT_COUNT);
    }
    if (idx == g_upload_snapshot_inflight_idx)
    {
        taskEXIT_CRITICAL();
        return -1;
    }

    if (g_upload_snapshot_latest_idx >= 0)
    {
        g_upload_snapshot_drop_count++;
        g_upload_snapshot_latest_idx = -1;
    }
    g_upload_snapshot_writing_idx = idx;
    taskEXIT_CRITICAL();
    return idx;
}

static void ESP_UploadSnapshot_FinishWrite(int8_t idx, ESP_UploadSnapshot_t *slot)
{
    if (idx < 0 || slot == NULL)
    {
        return;
    }

    taskENTER_CRITICAL();
    slot->seq = ++g_upload_snapshot_seq;
    slot->magic = ESP_UPLOAD_SNAPSHOT_MAGIC;
    g_upload_snapshot_latest_idx = idx;
    g_upload_snapshot_next_idx = (uint8_t)((idx + 1) % ESP_UPLOAD_SNAPSHOT_SLOT_COUNT);
    g_upload_snapshot_writing_idx = -1;
    g_upload_snapshot_publish_count++;
    taskEXIT_CRITICAL();
}

static void ESP_UploadSnapshot_PublishFromNodeChannels(uint8_t ready_buffer)
{
    int8_t idx = ESP_UploadSnapshot_BeginWrite();
    ESP_UploadSnapshot_t *slot;

    if (idx < 0)
    {
        g_upload_snapshot_drop_count++;
        return;
    }

    slot = &g_upload_snapshots[(uint8_t)idx];
    memset(slot, 0, sizeof(*slot));
    slot->tick_ms = HAL_GetTick();
    slot->ready_buffer = ready_buffer;
    slot->channel_count = 4U;
    slot->report_mode = 1U;
    slot->status_code = 1U;
    strncpy(slot->fault_code, g_fault_code, sizeof(slot->fault_code) - 1U);
    slot->fault_code[sizeof(slot->fault_code) - 1U] = '\0';

    for (uint8_t ch = 0U; ch < 4U; ch++)
    {
        int32_t cv_i = ESP_FloatToI32Scaled(node_channels[ch].current_value);
        slot->channels[ch].channel_id = node_channels[ch].id;
        slot->channels[ch].waveform_count = (uint16_t)WAVEFORM_POINTS;
        slot->channels[ch].fft_count = (uint16_t)FFT_POINTS;
        slot->channels[ch].value_scaled = cv_i;
        slot->channels[ch].current_value_scaled = cv_i;
        slot->current_value[ch] = node_channels[ch].current_value;
        memcpy(slot->waveform[ch], node_channels[ch].waveform, sizeof(slot->waveform[ch]));
        memcpy(slot->fft_data[ch], node_channels[ch].fft_data, sizeof(slot->fft_data[ch]));
        ESP_RtosYield();
    }

    ESP_UploadSnapshot_FinishWrite(idx, slot);
}

static const ESP_UploadSnapshot_t *ESP_UploadSnapshot_TryAcquireLatest(uint32_t *out_seq)
{
    int8_t idx;
    uint32_t seq;

    taskENTER_CRITICAL();
    idx = g_upload_snapshot_latest_idx;
    if (idx < 0 || g_upload_snapshot_inflight_idx >= 0 || idx == g_upload_snapshot_writing_idx)
    {
        taskEXIT_CRITICAL();
        return NULL;
    }
    g_upload_snapshot_latest_idx = -1;
    g_upload_snapshot_inflight_idx = idx;
    seq = g_upload_snapshots[(uint8_t)idx].seq;
    taskEXIT_CRITICAL();

    if (g_upload_snapshots[(uint8_t)idx].magic != ESP_UPLOAD_SNAPSHOT_MAGIC)
    {
        taskENTER_CRITICAL();
        if (g_upload_snapshot_inflight_idx == idx)
        {
            g_upload_snapshot_inflight_idx = -1;
        }
        taskEXIT_CRITICAL();
        return NULL;
    }

    if (out_seq != NULL)
    {
        *out_seq = seq;
    }
    return &g_upload_snapshots[(uint8_t)idx];
}

static void ESP_UploadSnapshot_Release(uint32_t seq)
{
    int8_t idx;

    taskENTER_CRITICAL();
    idx = g_upload_snapshot_inflight_idx;
    if (idx >= 0 && g_upload_snapshots[(uint8_t)idx].seq == seq)
    {
        g_upload_snapshot_inflight_idx = -1;
    }
    taskEXIT_CRITICAL();
}

#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
typedef enum
{
    ESP_FULL_TX_IDLE = 0,
    ESP_FULL_TX_BEGIN,
    ESP_FULL_TX_WAVE,
    ESP_FULL_TX_FFT,
    ESP_FULL_TX_END,
} ESP_FullTxPhase_t;

typedef struct
{
    uint8_t active;
    uint8_t one_shot;
    uint8_t channel_count;
    ESP_FullTxPhase_t phase;
    uint32_t frame_id;
    uint32_t snapshot_seq;
    uint32_t start_tick;
    uint32_t packet_count;
    uint32_t wave_step;
    uint32_t upload_points;
    const ESP_UploadSnapshot_t *snapshot;
    esp32_spi_report_channel_t channels[4];
    const float *waves[4];
    const float *ffts[4];
    uint16_t wave_source_counts[4];
    uint8_t channel_index;
    uint16_t element_offset;
} ESP_FullTxState_t;

static ESP_FullTxState_t g_full_tx_sm;

static void ESP_FullTx_ClearAndRelease(void)
{
    if (g_full_tx_sm.snapshot_seq != 0U)
    {
        ESP_UploadSnapshot_Release(g_full_tx_sm.snapshot_seq);
    }
    memset(&g_full_tx_sm, 0, sizeof(g_full_tx_sm));
}
#endif

// ---------- 串口控制台（调试串口 RX 中断） ----------
static uint8_t g_console_rx_byte = 0;
static volatile uint8_t g_console_line_ready = 0;
static char g_console_line[32];
static volatile uint8_t g_console_line_len = 0;

// ---------- 服务器下发命令解析 ----------
static volatile uint8_t g_server_reset_pending = 0;
// 服务器请求的上报模式：0=summary, 1=full
static volatile uint8_t g_server_report_full = (ESP32_SPI_STRESS_FULL_UPLOAD != 0) ? 1U : 0U;
static volatile uint8_t g_server_report_full_dirty = 0;
#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
static volatile uint16_t g_spi_full_manual_frames = 0;
static volatile uint8_t g_spi_full_continuous = (ESP32_SPI_FULL_CONTINUOUS_DEFAULT != 0) ? 1U : 0U;
static volatile uint8_t g_spi_full_waiting_result = 0;
static uint32_t g_spi_full_result_ref_seq = 0U;
static uint32_t g_spi_full_result_frame_id = 0U;
static uint32_t g_spi_full_result_start_tick = 0U;
static uint32_t g_spi_full_result_session_epoch = 0U;
static uint32_t g_spi_full_result_last_log_tick = 0U;
static uint32_t g_spi_full_result_last_poll_tick = 0U;
static uint32_t g_spi_full_holdoff_until_tick = 0U;
static uint32_t g_spi_full_timeout_count = 0U;
static uint32_t g_spi_full_busy_nack_count = 0U;
static uint32_t g_spi_full_http_fail_count = 0U;
#endif
// 服务器请求的降采样步进：1..64
static volatile uint32_t g_server_downsample_step = (uint32_t)WAVEFORM_SEND_STEP;
static volatile uint8_t g_server_downsample_dirty = 0;
// 服务器请求的上传点数（降采样后）：256..4096，256步进
static volatile uint32_t g_server_upload_points = (uint32_t)WAVEFORM_POINTS;
static volatile uint8_t g_server_upload_points_dirty = 0;
#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
static volatile uint8_t g_spi_comm_params_sync_pending = 0U;
static volatile uint8_t g_spi_report_mode_sync_pending = 0U;
static volatile uint8_t g_spi_report_mode_sync_target = 0U;
static ESP_CommParams_t g_spi_pending_comm_params;
#endif
// 当检测到链路异常关键字（CLOSED/ERROR）时置 1，主循环触发软重连



/* 滑动窗口：用于在流式数据中查找关键字。
 * 解决 DMA 分包导致关键字（如 "HTTP/1.1"）被切断的问题。 */

/* 调试与统计变量 */

