lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/EdgeComm/edge_comm.c
/* 链路健康监测 */

/* HTTP 发送流控门控
 * 作用：发送 HTTP 请求后置为 1，收到回复或超时后置为 0。
 * 防止请求发送过快淹没服务器，导致 TCP 拥塞或解析错误。 */

/* 分段发送状态（仅用于 ESP_Post_Data 的大包上报） */

/* 非分段 HTTP 发送链状态：header DMA -> body DMA */

/* ================= 通讯参数（运行时缓存） =================
 * 由 SD 文件 0:/config/ui_param.cfg 加载；若未加载则使用宏默认值。
 */
static volatile uint32_t g_comm_heartbeat_ms    = (uint32_t)ESP_HEARTBEAT_INTERVAL_MS;
static volatile uint32_t g_comm_min_interval_ms = (uint32_t)ESP_MIN_SEND_INTERVAL_MS;
static volatile uint32_t g_comm_http_timeout_ms = (uint32_t)ESP_HTTP_TIMEOUT_MS_DEFAULT;
static volatile uint32_t g_comm_hardreset_sec   = (uint32_t)ESP_NO_SERVER_RESPONSE_RECOVER_SEC;
static volatile uint32_t g_comm_wave_step       = (uint32_t)WAVEFORM_SEND_STEP;
static volatile uint32_t g_comm_upload_points  = (uint32_t)WAVEFORM_POINTS;
static volatile uint32_t g_comm_chunk_kb        = (uint32_t)ESP_CHUNK_KB_DEFAULT;
static volatile uint32_t g_comm_chunk_delay_ms  = (uint32_t)ESP_CHUNK_DELAY_MS_DEFAULT;




/* ================= ESP 通讯参数 API（运行时可配置） ================= */
uint32_t ESP_CommParams_HeartbeatMs(void)    { return (uint32_t)g_comm_heartbeat_ms; }
uint32_t ESP_CommParams_MinIntervalMs(void) { return (uint32_t)g_comm_min_interval_ms; }
uint32_t ESP_CommParams_HttpTimeoutMs(void) { return (uint32_t)g_comm_http_timeout_ms; }
uint32_t ESP_CommParams_HardResetSec(void)  { return (uint32_t)g_comm_hardreset_sec; }
uint32_t ESP_CommParams_WaveStep(void)      { return (uint32_t)g_comm_wave_step; }
uint32_t ESP_CommParams_UploadPoints(void)  { return (uint32_t)g_comm_upload_points; }
uint32_t ESP_CommParams_ChunkKb(void)       { return (uint32_t)g_comm_chunk_kb; }
uint32_t ESP_CommParams_ChunkDelayMs(void)  { return (uint32_t)g_comm_chunk_delay_ms; }

void ESP_CommParams_Get(ESP_CommParams_t *out)
{
    if (!out) return;
    out->heartbeat_ms    = (uint32_t)g_comm_heartbeat_ms;
    out->min_interval_ms = (uint32_t)g_comm_min_interval_ms;
    out->http_timeout_ms = (uint32_t)g_comm_http_timeout_ms;
    out->hardreset_sec   = (uint32_t)g_comm_hardreset_sec;
    out->wave_step       = (uint32_t)g_comm_wave_step;
    out->upload_points   = (uint32_t)g_comm_upload_points;
    out->chunk_kb        = (uint32_t)g_comm_chunk_kb;
    out->chunk_delay_ms  = (uint32_t)g_comm_chunk_delay_ms;
}

static bool ESP_CommParams_Equals(const ESP_CommParams_t *a, const ESP_CommParams_t *b)
{
    if (!a || !b) return false;
    return (a->heartbeat_ms == b->heartbeat_ms &&
            a->min_interval_ms == b->min_interval_ms &&
            a->http_timeout_ms == b->http_timeout_ms &&
            a->hardreset_sec == b->hardreset_sec &&
            a->wave_step == b->wave_step &&
            a->upload_points == b->upload_points &&
            a->chunk_kb == b->chunk_kb &&
            a->chunk_delay_ms == b->chunk_delay_ms);
}

static void ESP_ServerCmdAppendText(char *buf, size_t buf_size, const char *text)
{
    if (!buf || buf_size == 0U || !text || text[0] == '\0') {
        return;
    }
    size_t used = strlen(buf);
    if (used >= (buf_size - 1U)) {
        return;
    }
    if (used > 0U) {
        (void)snprintf(buf + used, buf_size - used, ", ");
        used = strlen(buf);
        if (used >= (buf_size - 1U)) {
            return;
        }
    }
    (void)snprintf(buf + used, buf_size - used, "%s", text);
}

static void ESP_ServerCmdAppendU32(char *buf, size_t buf_size, const char *key, uint32_t value)
{
    char item[40];
    (void)snprintf(item, sizeof(item), "%s=%lu", key, (unsigned long)value);
    ESP_ServerCmdAppendText(buf, buf_size, item);
}

static void ESP_BuildServerCommandSummary(char *buf,
                                          size_t buf_size,
                                          uint8_t reset,
                                          uint8_t has_mode,
                                          uint8_t full,
                                          uint8_t has_downsample,
                                          uint32_t downsample,
                                          uint8_t has_upload,
                                          uint32_t upload_points,
                                          uint8_t has_hb,
                                          uint32_t hb_ms,
                                          uint8_t has_min,
                                          uint32_t min_ms,
                                          uint8_t has_http,
                                          uint32_t http_ms,
                                          uint8_t has_chunk,
                                          uint32_t chunk_kb,
                                          uint8_t has_chunk_delay,
                                          uint32_t chunk_delay_ms)
{
    if (!buf || buf_size == 0U) {
        return;
    }
    buf[0] = '\0';
    if (reset) {
        ESP_ServerCmdAppendText(buf, buf_size, "reset=1");
    }
    if (has_mode) {
        ESP_ServerCmdAppendText(buf, buf_size, full ? "report_mode=full" : "report_mode=summary");
    }
    if (has_downsample) {
        ESP_ServerCmdAppendU32(buf, buf_size, "downsample_step", downsample);
    }
    if (has_upload) {
        ESP_ServerCmdAppendU32(buf, buf_size, "upload_points", upload_points);
    }
    if (has_hb) {
        ESP_ServerCmdAppendU32(buf, buf_size, "heartbeat_ms", hb_ms);
    }
    if (has_min) {
        ESP_ServerCmdAppendU32(buf, buf_size, "min_interval_ms", min_ms);
    }
    if (has_http) {
        ESP_ServerCmdAppendU32(buf, buf_size, "http_timeout_ms", http_ms);
    }
    if (has_chunk) {
        ESP_ServerCmdAppendU32(buf, buf_size, "chunk_kb", chunk_kb);
    }
    if (has_chunk_delay) {
        ESP_ServerCmdAppendU32(buf, buf_size, "chunk_delay_ms", chunk_delay_ms);
    }
    if (buf[0] == '\0') {
        ESP_ServerCmdAppendText(buf, buf_size, "command");
    }
}

static char g_server_cmd_last_applied_summary[192];
static uint32_t g_server_cmd_last_applied_tick = 0U;
static char g_server_cmd_pending_summary[192];
static uint8_t g_server_cmd_pending_active = 0U;
static uint8_t g_server_cmd_pending_saved = 0U;
static uint8_t g_server_cmd_pending_save_failed = 0U;
static uint8_t g_server_cmd_pending_applied = 0U;

static bool ESP_ServerCommandRecentlyApplied(const char *summary, uint32_t now_tick)
{
    if (!summary || summary[0] == '\0' || g_server_cmd_last_applied_summary[0] == '\0') {
        return false;
    }
    if (strncmp(summary, g_server_cmd_last_applied_summary, sizeof(g_server_cmd_last_applied_summary)) != 0) {
        return false;
    }
    return ((uint32_t)(now_tick - g_server_cmd_last_applied_tick) < (uint32_t)ESP_SERVER_CMD_DEDUPE_WINDOW_MS);
}

static void ESP_ServerCommandRememberApplied(const char *summary, uint32_t now_tick)
{
    if (!summary || summary[0] == '\0') {
        return;
    }
    strncpy(g_server_cmd_last_applied_summary, summary, sizeof(g_server_cmd_last_applied_summary) - 1U);
    g_server_cmd_last_applied_summary[sizeof(g_server_cmd_last_applied_summary) - 1U] = '\0';
    g_server_cmd_last_applied_tick = now_tick;
}

static void ESP_ServerCommandLogClear(void)
{
    g_server_cmd_pending_summary[0] = '\0';
    g_server_cmd_pending_active = 0U;
    g_server_cmd_pending_saved = 0U;
    g_server_cmd_pending_save_failed = 0U;
    g_server_cmd_pending_applied = 0U;
}

static void ESP_ServerCommandLogStore(const char *summary,
                                      uint8_t seen,
                                      uint8_t saved,
                                      uint8_t save_failed,
                                      uint8_t applied)
{
    if (seen == 0U || summary == NULL || summary[0] == '\0') {
        return;
    }
    strncpy(g_server_cmd_pending_summary, summary, sizeof(g_server_cmd_pending_summary) - 1U);
    g_server_cmd_pending_summary[sizeof(g_server_cmd_pending_summary) - 1U] = '\0';
    g_server_cmd_pending_active = 1U;
    if (saved != 0U) {
        g_server_cmd_pending_saved = 1U;
    }
    if (save_failed != 0U) {
        g_server_cmd_pending_save_failed = 1U;
    }
    if (applied != 0U) {
        g_server_cmd_pending_applied = 1U;
    }
}

static void ESP_ServerCommandLogRestore(char *summary,
                                        size_t summary_size,
                                        uint8_t *seen,
                                        uint8_t *saved,
                                        uint8_t *save_failed,
                                        uint8_t *applied)
{
    if (g_server_cmd_pending_active == 0U || summary == NULL || summary_size == 0U) {
        return;
    }
    strncpy(summary, g_server_cmd_pending_summary, summary_size - 1U);
    summary[summary_size - 1U] = '\0';
    if (seen != NULL) {
        *seen = 1U;
    }
    if (saved != NULL && g_server_cmd_pending_saved != 0U) {
        *saved = 1U;
    }
    if (save_failed != NULL && g_server_cmd_pending_save_failed != 0U) {
        *save_failed = 1U;
    }
    if (applied != NULL && g_server_cmd_pending_applied != 0U) {
        *applied = 1U;
    }
}

static uint32_t clamp_u32(uint32_t v, uint32_t lo, uint32_t hi)
{
    if (v < lo) return lo;
    if (v > hi) return hi;
    return v;
}

