lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/EdgeComm/edge_comm.c
    ESP_CommParams_t p;
    ESP_CommParams_Get(&p);

    FIL fil;
    if (f_open(&fil, UI_PARAM_TMP_FILE, FA_CREATE_ALWAYS | FA_WRITE) != FR_OK) {
        return false;
    }

    char buf[320];
    int n = snprintf(buf, sizeof(buf),
                     "HEARTBEAT_MS=%lu\n"
                     "SENDLIMIT_MS=%lu\n"
                     "HTTP_TIMEOUT_MS=%lu\n"
                     "HARDRESET_S=%lu\n"
                     "DOWNSAMPLE_STEP=%lu\n"
                     "UPLOAD_POINTS=%lu\n"
                     "CHUNK_KB=%lu\n"
                     "CHUNK_DELAY_MS=%lu\n",
                     (unsigned long)p.heartbeat_ms,
                     (unsigned long)p.min_interval_ms,
                     (unsigned long)p.http_timeout_ms,
                     (unsigned long)p.hardreset_sec,
                     (unsigned long)p.wave_step,
                     (unsigned long)p.upload_points,
                     (unsigned long)p.chunk_kb,
                     (unsigned long)p.chunk_delay_ms);
    if (n <= 0 || n >= (int)sizeof(buf)) {
        (void)f_close(&fil);
        (void)f_unlink(UI_PARAM_TMP_FILE);
        return false;
    }

    UINT bw = 0;
    FRESULT wr = f_write(&fil, buf, (UINT)n, &bw);
    if (wr != FR_OK || bw != (UINT)n) {
        (void)f_close(&fil);
        (void)f_unlink(UI_PARAM_TMP_FILE);
        return false;
    }

    FRESULT sr = f_sync(&fil);
    (void)f_close(&fil);
    if (sr != FR_OK) {
        (void)f_unlink(UI_PARAM_TMP_FILE);
        return false;
    }

    (void)f_unlink(UI_PARAM_CFG_FILE);
    FRESULT r = f_rename(UI_PARAM_TMP_FILE, UI_PARAM_CFG_FILE);
    if (r != FR_OK) {
        (void)f_unlink(UI_PARAM_TMP_FILE);
        return false;
    }
    return true;
}

static bool esp_autoreport_write(bool auto_reconnect_en, bool last_reporting)
{
    if (!esp_sd_try_mount(200U)) {
        return false;
    }
    if (esp_cfg_ensure_dir() != FR_OK) {
        return false;
    }

    FIL fil;
    if (f_open(&fil, UI_AUTOREPORT_TMP_FILE, FA_CREATE_ALWAYS | FA_WRITE) != FR_OK) {
        return false;
    }

    char buf[96];
    int n = snprintf(buf, sizeof(buf),
                     "AUTO_RECONNECT=%u\r\n"
                     "LAST_REPORTING=%u\r\n",
                     auto_reconnect_en ? 1u : 0u,
                     last_reporting ? 1u : 0u);
    if (n < 0) {
        (void)f_close(&fil);
        (void)f_unlink(UI_AUTOREPORT_TMP_FILE);
        return false;
    }

    UINT bw = 0;
    (void)f_write(&fil, buf, (UINT)strlen(buf), &bw);
    (void)f_close(&fil);

    /* 原子替换：先删旧文件，再 rename 临时文件 */
    (void)f_unlink(UI_AUTOREPORT_CFG_FILE);
    FRESULT r = f_rename(UI_AUTOREPORT_TMP_FILE, UI_AUTOREPORT_CFG_FILE);
    if (r != FR_OK) {
        (void)f_unlink(UI_AUTOREPORT_TMP_FILE);
        return false;
    }
    return true;
}

bool ESP_AutoReconnect_Read(bool *auto_reconnect_en, bool *last_reporting)
{
    /* 默认值：开启“断电重连”功能，但上次上报默认=否（这样首次不会自动连接） */
    bool en = true;
    bool last = false;

    if (!esp_sd_try_mount(120U)) {
        if (auto_reconnect_en) *auto_reconnect_en = en;
        if (last_reporting) *last_reporting = last;
        return false;
    }

    FIL fil;
    if (f_open(&fil, UI_AUTOREPORT_CFG_FILE, FA_READ) != FR_OK) {
        if (auto_reconnect_en) *auto_reconnect_en = en;
        if (last_reporting) *last_reporting = last;
        return false;
    }

    char line[96];
    while (f_gets(line, sizeof(line), &fil)) {
        cfg_rstrip(line);
        if (strncmp(line, "AUTO_RECONNECT=", 15) == 0) {
            uint32_t v;
            if (cfg_parse_u32_relaxed(line + 15, &v)) en = (v != 0U);
        } else if (strncmp(line, "LAST_REPORTING=", 15) == 0) {
            uint32_t v;
            if (cfg_parse_u32_relaxed(line + 15, &v)) last = (v != 0U);
        }
    }
    (void)f_close(&fil);

    if (auto_reconnect_en) *auto_reconnect_en = en;
    if (last_reporting) *last_reporting = last;
    return true;
}

bool ESP_AutoReconnect_SetEnabled(bool auto_reconnect_en)
{
    bool cur_en = true, cur_last = false;
    (void)ESP_AutoReconnect_Read(&cur_en, &cur_last);
    return esp_autoreport_write(auto_reconnect_en, cur_last);
}

bool ESP_AutoReconnect_SetLastReporting(bool last_reporting)
{
    bool cur_en = true, cur_last = false;
    (void)ESP_AutoReconnect_Read(&cur_en, &cur_last);
    return esp_autoreport_write(cur_en, last_reporting);
}

/* 启动前置：从 UI 保存的 SD 文件读取 WiFi/Server 配置并应用 */

static void ESP_UploadMode_ApplyLoaded(uint8_t full)
{
    full = full ? 1U : 0U;
    g_server_report_full = full;
    g_server_report_full_dirty = 0U;
#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
    g_spi_full_continuous = full;
    if (!full) {
        g_spi_full_manual_frames = 0U;
        ESP_SPI_FullResetUploadRuntimeState();
    }
#endif
}

bool ESP_CommParams_SaveRuntimeToSD(void)
{
    return ESP_CommParams_SaveToSD();
}

static bool ESP_UploadMode_LoadFromSD(void)
{
    if (!esp_sd_try_mount(120U)) {
        return false;
    }

    FIL fil;
    if (f_open(&fil, UI_UPLOAD_CFG_FILE, FA_READ) != FR_OK) {
        return false;
    }

    uint8_t full = g_server_report_full ? 1U : 0U;
    char line[96];
    while (f_gets(line, sizeof(line), &fil)) {
        cfg_rstrip(line);
        if (strncmp(line, "REPORT_MODE=", 12) == 0) {
            const char *v = line + 12;
            if (strcmp(v, "full") == 0 || strcmp(v, "FULL") == 0 || strcmp(v, "1") == 0) {
                full = 1U;
            } else if (strcmp(v, "summary") == 0 || strcmp(v, "SUMMARY") == 0 || strcmp(v, "0") == 0) {
                full = 0U;
            }
        }
    }
    (void)f_close(&fil);

    ESP_UploadMode_ApplyLoaded(full);
    ESP_Log("[ESP] upload mode loaded from SD: %s\r\n", full ? "full" : "summary");
    return true;
}

static bool ESP_UploadMode_SaveToSD(uint8_t full)
{
    if (!esp_sd_try_mount(200U)) {
        return false;
    }
    if (esp_cfg_ensure_dir() != FR_OK) {
        return false;
    }

    FIL fil;
    if (f_open(&fil, UI_UPLOAD_TMP_FILE, FA_CREATE_ALWAYS | FA_WRITE) != FR_OK) {
        return false;
    }

    char buf[64];
    int n = snprintf(buf, sizeof(buf),
                     "REPORT_MODE=%s\r\n",
                     full ? "full" : "summary");
    if (n <= 0 || n >= (int)sizeof(buf)) {
        (void)f_close(&fil);
        (void)f_unlink(UI_UPLOAD_TMP_FILE);
        return false;
    }

