lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/EdgeComm/edge_comm.c
    UINT bw = 0;
    FRESULT wr = f_write(&fil, buf, (UINT)n, &bw);
    FRESULT sr = f_sync(&fil);
    (void)f_close(&fil);
    if (wr != FR_OK || sr != FR_OK || bw != (UINT)n) {
        (void)f_unlink(UI_UPLOAD_TMP_FILE);
        return false;
    }

    (void)f_unlink(UI_UPLOAD_CFG_FILE);
    FRESULT rn = f_rename(UI_UPLOAD_TMP_FILE, UI_UPLOAD_CFG_FILE);
    if (rn != FR_OK) {
        (void)f_unlink(UI_UPLOAD_TMP_FILE);
        return false;
    }
    return true;
}

bool ESP_Config_LoadFromSD_UIFiles(void)
{
    if (!esp_sd_try_mount(120U)) {
        return false;
    }

    /* 以当前配置为基底（若未加载则会先装载默认值） */
    SystemConfig_t cfg = *ESP_Config_Get();
    bool wifi_loaded = false;
    bool server_loaded = false;

    /* WiFi */
    {
        FIL fil;
        if (f_open(&fil, UI_WIFI_CFG_FILE, FA_READ) == FR_OK) {
            char line[160];
            while (f_gets(line, sizeof(line), &fil)) {
                cfg_rstrip(line);
                if (strncmp(line, "SSID=", 5) == 0) {
                    strncpy(cfg.wifi_ssid, line + 5, sizeof(cfg.wifi_ssid) - 1);
                    cfg.wifi_ssid[sizeof(cfg.wifi_ssid) - 1] = '\0';
                } else if (strncmp(line, "PWD=", 4) == 0) {
                    strncpy(cfg.wifi_password, line + 4, sizeof(cfg.wifi_password) - 1);
                    cfg.wifi_password[sizeof(cfg.wifi_password) - 1] = '\0';
                }
            }
            (void)f_close(&fil);
            wifi_loaded = true;
        }
    }

    /* Server */
    {
        FIL fil;
        if (f_open(&fil, UI_SERVER_CFG_FILE, FA_READ) == FR_OK) {
            char line[160];
            while (f_gets(line, sizeof(line), &fil)) {
                cfg_rstrip(line);
                if (strncmp(line, "IP=", 3) == 0) {
                    strncpy(cfg.server_ip, line + 3, sizeof(cfg.server_ip) - 1);
                    cfg.server_ip[sizeof(cfg.server_ip) - 1] = '\0';
                } else if (strncmp(line, "PORT=", 5) == 0) {
                    uint32_t v;
                    if (cfg_parse_u32_relaxed(line + 5, &v) && v > 0U && v <= 65535U) {
                        cfg.server_port = (uint16_t)v;
                    }
                } else if (strncmp(line, "ID=", 3) == 0) {
                    strncpy(cfg.node_id, line + 3, sizeof(cfg.node_id) - 1);
                    cfg.node_id[sizeof(cfg.node_id) - 1] = '\0';
                } else if (strncmp(line, "LOC=", 4) == 0) {
                    strncpy(cfg.node_location, line + 4, sizeof(cfg.node_location) - 1);
                    cfg.node_location[sizeof(cfg.node_location) - 1] = '\0';
                }
            }
            (void)f_close(&fil);
            server_loaded = true;
        }
    }

    if (wifi_loaded && server_loaded) {
        ESP_Config_Apply(&cfg);
    } else {
        ESP_Log("[ESP_CFG] SD config incomplete: wifi=%u server=%u\r\n",
                wifi_loaded ? 1U : 0U,
                server_loaded ? 1U : 0U);
    }
    (void)ESP_UploadMode_LoadFromSD();
    return (wifi_loaded && server_loaded);
}

static bool ESP_Config_IsValidForLink(const SystemConfig_t *cfg)
{
    if (cfg == NULL) return false;
    if (cfg->wifi_ssid[0] == '\0') return false;
    if (cfg->server_ip[0] == '\0') return false;
    if (cfg->server_port == 0U) return false;
    if (cfg->node_id[0] == '\0') return false;
    return true;
}

bool ESP_Config_LoadRuntimeFromSD(void)
{
    bool cfg_ok;
    bool comm_ok;
    const SystemConfig_t *cfg;

    ESP_LoadConfig();
    cfg_ok = ESP_Config_LoadFromSD_UIFiles();
    comm_ok = ESP_CommParams_LoadFromSD();
    (void)ESP_UploadMode_LoadFromSD();

    cfg = ESP_Config_Get();
    if (!ESP_Config_IsValidForLink(cfg)) {
        ESP_Log("[ESP_CFG] runtime SD load invalid: cfg_ok=%u ssid=%u host=%u port=%u node=%u\r\n",
                cfg_ok ? 1U : 0U,
                (cfg && cfg->wifi_ssid[0]) ? 1U : 0U,
                (cfg && cfg->server_ip[0]) ? 1U : 0U,
                (cfg && cfg->server_port) ? 1U : 0U,
                (cfg && cfg->node_id[0]) ? 1U : 0U);
        return false;
    }
    if (!cfg_ok) {
        ESP_Log("[ESP_CFG] SD UI config incomplete; using current runtime link config.\r\n");
    }

    if (!comm_ok) {
        ESP_Log("[ESP_CFG] ui_param.cfg missing/unreadable; using runtime/default comm params.\r\n");
    }
    return true;
}

/* Utility functions. */

/* Debug console uses USART1 only; ESP32 transport is SPI. */
static UART_HandleTypeDef *ESP_GetLogUart(void)
{
#if (ESP_LOG_UART_PORT == 1)
    extern UART_HandleTypeDef huart1;
    return &huart1;
#else
    return NULL;
#endif
}

/* ================= 核心代码 ================= */

/**
 * @brief  EdgeComm 初始化主流程
 */
#if 0
/* 通用波形生成与FFT计算函数（已停用：改为 ADS131A04 真实采样） */
static void Process_Channel_Data(int ch_id, float base_dc, float ripple_amp, float noise_level)
{
    static float time_t = 0.0f;
    float noise;
    int i;

    // 模拟瞬时值波动 (低频慢变化)
    node_channels[ch_id].current_value = base_dc + ripple_amp * 0.1f * arm_sin_f32(2.0f * PI * 0.5f * time_t);

    // 1. 生成波形 (50Hz + 150Hz谐波 + 噪声)
    for (i = 0; i < WAVEFORM_POINTS; i++)
    {
        // 基础噪声
        noise = ((float)(rand() % 100) / 100.0f - 0.5f) * noise_level;

        // 漏电流特殊处理：加一些随机尖峰
        if (ch_id == 3 && (rand() % 100) > 98)
        {
            noise += 5.0f; // 突发漏电尖峰
        }

        // 信号组合：直流基准 + 50Hz纹波 + 150Hz谐波 + 噪声
        float phase = (float)ch_id * 0.5f; // 不同通道相位错开

        node_channels[ch_id].waveform[i] = node_channels[ch_id].current_value + ripple_amp * arm_sin_f32(2.0f * PI * 50.0f * ((float)i * 0.0005f) + phase) + (ripple_amp * 0.3f) * arm_sin_f32(2.0f * PI * 150.0f * ((float)i * 0.0005f)) + noise;
    }

    // 2. FFT 计算 (使用 CMSIS-DSP 库)
    arm_rfft_fast_f32(&S, node_channels[ch_id].waveform, fft_output_buf, 0);
    arm_cmplx_mag_f32(fft_output_buf, fft_mag_buf, WAVEFORM_POINTS / 2);

    // 3. 填充 FFT (归一化处理)
    node_channels[ch_id].fft_data[0] = 0; // 去直流分量
    for (i = 1; i < FFT_POINTS; i++)
    {
        // 归一化公式：幅度 = (FFT模值 / (N/2)) * 2
        node_channels[ch_id].fft_data[i] = (fft_mag_buf[i] / (float)(WAVEFORM_POINTS / 2)) * 2.0f;
    }

    // 4. 恢复波形 (因为 arm_rfft_fast_f32 是 In-Place 运算，会破坏原 buffer)
    // 这里为了 JSON 发送原始波形，需要重新生成一遍
    double sum = 0.0;
    for (i = 0; i < WAVEFORM_POINTS; i++)
    {
        float phase = (float)ch_id * 0.5f;
        float y = node_channels[ch_id].current_value +
                  ripple_amp * arm_sin_f32(2.0f * PI * 50.0f * ((float)i * 0.0005f) + phase) +
                  (ripple_amp * 0.3f) * arm_sin_f32(2.0f * PI * 150.0f * ((float)i * 0.0005f));
        node_channels[ch_id].waveform[i] = y;
        sum += (double)y;
    }

    /* 卡片显示值改为“本帧波形平均值（mean）”
     * - 之前 current_value 是模拟瞬时值（带慢变化），不是严格平均值
     * - 这里用 mean 更符合“平均值”语义，并且对噪声/非整周期截断更鲁棒 */
    node_channels[ch_id].current_value = ESP_SafeFloat((float)(sum / (double)WAVEFORM_POINTS));

    if (ch_id == 3)
        time_t += 0.05f; // 时间步进
}
#endif

