lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/EdgeComm/edge_comm.c
static void ESP_SPI_FullPrintStatus(void)
{
#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
    (void)ESP_SPI_FullClearStaleWaitState("status");
    (void)ESP_SPI_FullClearBlockedTxState("status", (g_esp_ready == 0U) ? 1U : 0U);
    ESP_Log("[ESP32SPI] full status: requested=%u continuous=%u pending=%u reporting=%u ready=%u active=%u phase=%u\r\n",
            (unsigned int)g_server_report_full,
            (unsigned int)g_spi_full_continuous,
            (unsigned int)g_spi_full_manual_frames,
            (unsigned int)ESP_UI_IsReporting(),
            (unsigned int)g_esp_ready,
            (unsigned int)g_full_tx_sm.active,
            (unsigned int)g_full_tx_sm.phase);
    if (g_spi_full_waiting_result != 0U) {
        ESP_Log("[ESP32SPI] full waiting: frame=%lu ref=%lu elapsed=%lums\r\n",
                (unsigned long)g_spi_full_result_frame_id,
                (unsigned long)g_spi_full_result_ref_seq,
                (unsigned long)(HAL_GetTick() - g_spi_full_result_start_tick));
    }
#else
    ESP_Log("[ESP32SPI] full upload is not compiled in this build.\r\n");
#endif
}

static void ESP_SetFaultCode(const char *code)
{
    if (!code)
        return;
    char c0 = code[0];
    char c1 = code[1];
    char c2 = code[2];
    if (c0 == 'e')
        c0 = 'E'; // 兼容小写
    if (c0 != 'E')
        return;
    if (c1 < '0' || c1 > '9')
        return;
    if (c2 < '0' || c2 > '9')
        return;
    g_fault_code[0] = 'E';
    g_fault_code[1] = c1;
    g_fault_code[2] = c2;
    g_fault_code[3] = 0;
    ESP_Log("[控制台] 故障码已切换为: %s（下一次上报生效）\r\n", g_fault_code);
}

static void ESP_Console_HandleLine(char *line)
{
    if (!line)
        return;
    StrTrimInPlace(line);
    if (line[0] == 0)
        return;

    if (strcmp(line, "spiping") == 0 || strcmp(line, "SPIPING") == 0)
    {
        ESP32_SPI_DebugRunPing();
        return;
    }

    if (strcmp(line, "wifi") == 0 || strcmp(line, "WIFI") == 0)
    {
        (void)ESP_UI_SendCmd(ESP_UI_CMD_WIFI);
        ESP_Log("[Console] queued WIFI step\r\n");
        return;
    }

    if (strcmp(line, "tcp") == 0 || strcmp(line, "TCP") == 0)
    {
        (void)ESP_UI_SendCmd(ESP_UI_CMD_TCP);
        ESP_Log("[Console] queued TCP/CLOUD step\r\n");
        return;
    }

    if (strcmp(line, "reg") == 0 || strcmp(line, "REG") == 0)
    {
        (void)ESP_UI_SendCmd(ESP_UI_CMD_REG);
        ESP_Log("[Console] queued REG step\r\n");
        return;
    }

    if (strcmp(line, "report") == 0 || strcmp(line, "REPORT") == 0)
    {
        (void)ESP_UI_SendCmd(ESP_UI_CMD_REPORT_TOGGLE);
        ESP_Log("[Console] queued REPORT toggle\r\n");
        return;
    }

    if (strcmp(line, "auto") == 0 || strcmp(line, "AUTO") == 0)
    {
        (void)ESP_UI_SendCmd(ESP_UI_CMD_AUTO_CONNECT);
        ESP_Log("[Console] queued AUTO connect/report sequence\r\n");
        return;
    }

    if (strcmp(line, "full1") == 0 || strcmp(line, "FULL1") == 0)
    {
        ESP_SPI_FullArmFrames(1U);
        return;
    }

    if (strcmp(line, "full10") == 0 || strcmp(line, "FULL10") == 0)
    {
        ESP_SPI_FullArmFrames(10U);
        return;
    }

    if (strcmp(line, "fullon") == 0 || strcmp(line, "FULLON") == 0)
    {
        ESP_SPI_FullSetContinuous(1U);
        return;
    }

    if (strcmp(line, "fulloff") == 0 || strcmp(line, "FULLOFF") == 0)
    {
        ESP_SPI_FullSetContinuous(0U);
        return;
    }

    {
        ESP_SPI_FullPrintStatus();
        return;
    }

    if (strcmp(line, "help") == 0 || strcmp(line, "?") == 0)
    {
        ESP_Log("[控制台] 可用命令：\r\n");
        ESP_Log("  - auto/wifi/tcp/reg/report : SPI cloud upload control\r\n");
        ESP_Log("  - spiping/fullstat/full1/full10/fullon/fulloff : SPI diagnostics\r\n");
        ESP_Log("  - E00/E01/E02... ：切换上报故障码\r\n");
        ESP_Log("  - help 或 ?      ：显示帮助\r\n");
        return;
    }

    // 格式: E01
    if ((line[0] == 'E' || line[0] == 'e') && strlen(line) == 3)
    {
        ESP_SetFaultCode(line);
        return;
    }

    // 格式: fault E01
    if (strncmp(line, "fault", 5) == 0)
    {
        char *p = line + 5;
        while (*p == ' ' || *p == '\t')
            p++;
        if (strlen(p) == 3 && (p[0] == 'E' || p[0] == 'e'))
        {
            ESP_SetFaultCode(p);
            return;
        }
    }

    ESP_Log("[控制台] 未识别命令: %s（输入 help 查看帮助）\r\n", line);
}

static void ESP_SetServerReportMode(uint8_t full)
{
    full = (full != 0U) ? 1U : 0U;
    /* Treat every cloud command as an apply request.  After boot the runtime
       mode may come from SD while this command-cache variable is still at its
       compile-time default, so comparing only against g_server_report_full can
       incorrectly drop idempotent-looking commands. */
    g_server_report_full = full;
    g_server_report_full_dirty = 1U;
}

static void ESP_SPI_ResetLocalReportState(const char *reason)
{
    uint8_t want_report = (g_report_enabled != 0U) ? 1U : 0U;
    g_esp_ready = 0U;
    g_ui_reg_ok = 0U;
    g_ui_tcp_ok = 0U;
    g_ui_wifi_ok = 0U;
#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
    g_spi_full_manual_frames = 0U;
    ESP_SPI_FullResetUploadRuntimeState();
#endif
    if (want_report != 0U) {
        g_ui_auto_recover_want_report = 1U;
        (void)ESP_AutoReconnect_SetLastReporting(true);
        ESP_Log("[ESP32SPI] local report path degraded, keep desired reporting and recover: %s\r\n",
                (reason != NULL) ? reason : "unspecified");
        ESP_UI_ScheduleAutoRecover(reason, 1U);
    } else {
        g_report_enabled = 0U;
        ESP_SetServerReportMode(0U);
        (void)ESP_AutoReconnect_SetLastReporting(false);
        ESP_Log("[ESP32SPI] local report state reset: %s\r\n",
                (reason != NULL) ? reason : "unspecified");
    }
}

#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
static void ESP_SPI_FullClearWaitState(void)
{
    g_spi_full_waiting_result = 0U;
    g_spi_full_result_ref_seq = 0U;
    g_spi_full_result_frame_id = 0U;
    g_spi_full_result_start_tick = 0U;
    g_spi_full_result_session_epoch = 0U;
    g_spi_full_result_last_log_tick = 0U;
    g_spi_full_result_last_poll_tick = 0U;
}

