lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/EdgeComm/edge_comm.c
static void ESP_SetServerDownsampleStep(uint32_t step)
{
    if (step < 1U) step = 1U;
    if (step > 64U) step = 64U;
    /* Always apply a cloud command.  The current runtime value is authoritative
       and may differ from this command-cache after SD restore. */
    g_server_downsample_step = step;
    g_server_downsample_dirty = 1U;
}

static bool ESP_TryParseDownsampleStep(const char *s, uint32_t *out_step)
{
    if (!s || !out_step) {
        return false;
    }

    const char *p = strstr(s, "\"downsample_step\"");
    if (!p) {
        return false;
    }
    p += strlen("\"downsample_step\"");
    while (*p == ' ' || *p == '\t' || *p == '\r' || *p == '\n') p++;
    if (*p != ':') {
        return false;
    }
    p++;
    while (*p == ' ' || *p == '\t' || *p == '\r' || *p == '\n') p++;
    if (*p < '0' || *p > '9') {
        return false;
    }

    uint32_t step = 0;
    while (*p >= '0' && *p <= '9')
    {
        step = (step * 10U) + (uint32_t)(*p - '0');
        if (step > 9999U) {
            break;
        }
        p++;
    }

    if (step < 1U) step = 1U;
    if (step > 64U) step = 64U;
    *out_step = step;
    return true;
}

static void ESP_SetServerUploadPoints(uint32_t points)
{
    uint32_t maxp = (uint32_t)WAVEFORM_POINTS;
    if (maxp == 0u) {
        points = 0u;
    } else if (maxp < 256u) {
        points = maxp;
    } else {
        if (points < 256u) points = 256u;
        if (points > maxp) points = maxp;
        /* 容错：非 256 步进时就近取整到 256 倍数 */
        points = ((points + 128u) / 256u) * 256u;
        if (points < 256u) points = 256u;
        if (points > maxp) points = maxp;
    }

    /* Always apply a cloud command.  This fixes the 2048 -> 4096 case after
       reboot/SD restore: g_comm_upload_points can be 2048 while this cache is
       still the default 4096, and the old comparison dropped the command. */
    g_server_upload_points = points;
    g_server_upload_points_dirty = 1U;
}

static bool ESP_TryParseUploadPoints(const char *s, uint32_t *out_points)
{
    if (!s || !out_points) {
        return false;
    }

    const char *p = strstr(s, "\"upload_points\"");
    if (!p) {
        return false;
    }
    p += strlen("\"upload_points\"");
    while (*p == ' ' || *p == '\t' || *p == '\r' || *p == '\n') p++;
    if (*p != ':') {
        return false;
    }
    p++;
    while (*p == ' ' || *p == '\t' || *p == '\r' || *p == '\n') p++;
    if (*p < '0' || *p > '9') {
        return false;
    }

    uint32_t points = 0;
    while (*p >= '0' && *p <= '9')
    {
        points = (points * 10U) + (uint32_t)(*p - '0');
        if (points > 10000000U) {
            break;
        }
        p++;
    }

    *out_points = points;
    return true;
}

static void ESP_SPI_ApplyCommParamsToCoprocessor(const ESP_CommParams_t *p)
{
    if (!p || !g_esp_ready) {
        return;
    }
#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
    if (ESP_SPI_FullControlBusy()) {
        ESP_SPI_QueueCommParamsSync(p);
        return;
    }
#endif
    if (!ESP32_SPI_ApplyCommParams(p->heartbeat_ms,
                                   p->min_interval_ms,
                                   p->http_timeout_ms,
                                   3000U,
                                   p->wave_step,
                                   p->upload_points,
                                   p->hardreset_sec,
                                   p->chunk_kb,
                                   p->chunk_delay_ms)) {
        ESP_Log("[ESP32SPI] comm params sync failed\r\n");
    }
}

void ESP_Console_Init(void)
{
#if (ESP_CONSOLE_ENABLE)
    UART_HandleTypeDef *hu = ESP_GetLogUart(); // 默认 USART1
    if (!hu)
        return;

    // 启动 1 字节 RX 中断（比主循环轮询稳定，避免“输入了但没反应”）
    HAL_UART_Receive_IT(hu, &g_console_rx_byte, 1);
    ESP_Log("[控制台] 已启用：输入 E01 回车注入故障；输入 E00 回车清除。\r\n");
#endif
}

/**
 * @brief  控制台轮询任务
 * @note   在主循环中调用，处理用户输入和服务器指令
 */
void ESP_Console_Poll(void)
{
#if (ESP_CONSOLE_ENABLE)
    uint32_t now = HAL_GetTick();
    uint8_t server_cmd_seen = 0U;
    uint8_t server_cmd_saved = 0U;
    uint8_t server_cmd_save_failed = 0U;
    uint8_t server_cmd_applied = 0U;
    static char server_cmd_summary[192];

    server_cmd_summary[0] = '\0';
    ESP_ServerCommandLogRestore(server_cmd_summary,
                                sizeof(server_cmd_summary),
                                &server_cmd_seen,
                                &server_cmd_saved,
                                &server_cmd_save_failed,
                                &server_cmd_applied);
    // 1) 处理“已收到的一整行”控制台指令
    if (g_console_line_ready)
    {
        g_console_line_ready = 0;
        g_console_line[g_console_line_len] = 0;
        ESP_Console_HandleLine(g_console_line);
        g_console_line_len = 0;
    }

    {
        static uint32_t s_last_async_event_poll_tick = 0U;
        uint8_t can_apply_server_cmd = 1U;
        uint8_t reset = 0U, has_mode = 0U, full = 0U;
        uint8_t has_downsample = 0U, has_upload = 0U;
        uint8_t has_hb = 0U, has_min = 0U, has_http = 0U, has_chunk = 0U, has_chunk_delay = 0U;
        uint32_t downsample = 0U, upload_points = 0U;
        uint32_t hb_ms = 0U, min_ms = 0U, http_ms = 0U, chunk_kb = 0U, chunk_delay_ms = 0U;

        /* Async cloud events are delivered only when STM32 clocks the SPI link.
           In summary/idle periods there may be no full-frame result wait loop,
           so server commands can otherwise sit inside the ESP32 event queue for
           minutes.  Poll a lightweight NOOP regularly whenever the link is idle
           enough, so report_mode/upload_points/downsample commands become
           visible quickly in every operating mode. */
        if (g_esp_ready != 0U &&
#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
            !ESP_SPI_FullControlBusy() &&
#endif
            ((now - s_last_async_event_poll_tick) >= 100U)) {
            s_last_async_event_poll_tick = now;
            (void)ESP32_SPI_PollEvents(10U);
        }

#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
        can_apply_server_cmd = (ESP_SPI_FullControlBusy() == 0U) ? 1U : 0U;
#endif

