lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/EdgeComm/edge_comm.c
        if (server_cmd_seen == 0U &&
            can_apply_server_cmd != 0U &&
            ESP32_SPI_ConsumeServerCommand(&reset,
                                           &has_mode,
                                           &full,
                                           &has_downsample,
                                           &downsample,
                                           &has_upload,
                                           &upload_points,
                                           &has_hb,
                                           &hb_ms,
                                           &has_min,
                                           &min_ms,
                                           &has_http,
                                           &http_ms,
                                            &has_chunk,
                                            &chunk_kb,
                                           &has_chunk_delay,
                                           &chunk_delay_ms)) {
            ESP_BuildServerCommandSummary(server_cmd_summary,
                                          sizeof(server_cmd_summary),
                                          reset,
                                          has_mode,
                                          full,
                                          has_downsample,
                                          downsample,
                                          has_upload,
                                          upload_points,
                                          has_hb,
                                          hb_ms,
                                          has_min,
                                          min_ms,
                                          has_http,
                                          http_ms,
                                          has_chunk,
                                          chunk_kb,
                                          has_chunk_delay,
                                          chunk_delay_ms);
            if (!ESP_ServerCommandRecentlyApplied(server_cmd_summary, now)) {
                server_cmd_seen = 1U;
                ESP_ServerCommandLogStore(server_cmd_summary, server_cmd_seen, 0U, 0U, 0U);
                if (reset) {
                    g_server_reset_pending = 1U;
                }
                if (has_mode) {
                    ESP_SetServerReportMode(full);
                }
                if (has_downsample) {
                    ESP_SetServerDownsampleStep(downsample);
                }
                if (has_upload) {
                    ESP_SetServerUploadPoints(upload_points);
                }
                if (has_hb || has_min || has_http || has_chunk || has_chunk_delay) {
                    ESP_CommParams_t old_p;
                    ESP_CommParams_t p;
                    ESP_CommParams_Get(&old_p);
                    p = old_p;
                    if (has_hb) {
                        p.heartbeat_ms = hb_ms;
                    }
                    if (has_min) {
                        p.min_interval_ms = min_ms;
                    }
                    if (has_http) {
                        p.http_timeout_ms = http_ms;
                    }
                    if (has_chunk) {
                        p.chunk_kb = chunk_kb;
                    }
                    if (has_chunk_delay) {
                        p.chunk_delay_ms = chunk_delay_ms;
                    }
                    bool params_changed = !ESP_CommParams_Equals(&old_p, &p);
                    if (params_changed) {
                        ESP_CommParams_Apply(&p);
                        ESP_CommParams_Get(&p);
                        if (ESP_CommParams_SaveToSD()) {
                            server_cmd_saved = 1U;
                            ESP_SPI_ApplyCommParamsToCoprocessor(&p);
                            server_cmd_applied = 1U;
                        } else {
                            ESP_CommParams_Apply(&old_p);
                            server_cmd_save_failed = 1U;
                        }
                    } else {
                        ESP_SPI_ApplyCommParamsToCoprocessor(&p);
                        server_cmd_applied = 1U;
                    }
                }
            }
        }
    }

#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
    if (ESP_SPI_FullControlBusy()) {
        ESP_ServerCommandLogStore(server_cmd_summary,
                                  server_cmd_seen,
                                  server_cmd_saved,
                                  server_cmd_save_failed,
                                  server_cmd_applied);
        return;
    }
#endif

    // 2) 处理“服务器下发 reset”指令
    if (g_server_reset_pending)
    {
        g_server_reset_pending = 0;
        ESP_SetFaultCode("E00");
        server_cmd_applied = 1U;
    }

    // 2.0) Apply server-issued report_mode.
    if (g_server_report_full_dirty)
    {
        uint8_t full = g_server_report_full ? 1U : 0U;
        const char *mode_text = full ? "full" : "summary";
        uint8_t mode_persist_changed = 1U;
        g_server_report_full_dirty = 0;
#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
        mode_persist_changed = (g_spi_full_continuous != full) ? 1U : 0U;
#endif
        if (mode_persist_changed != 0U) {
            if (!ESP_UploadMode_SaveToSD(full)) {
                server_cmd_save_failed = 1U;
                if (server_cmd_seen != 0U) {
                    ESP_Log("[SERVER_CMD] save_failed: %s\r\n", server_cmd_summary);
                }
            } else {
                server_cmd_saved = 1U;
            }
        }
#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
        g_spi_full_continuous = full;
        if (!full) {
            g_spi_full_manual_frames = 0U;
            if (g_spi_full_waiting_result == 0U && g_full_tx_sm.active == 0U) {
                ESP_SPI_FullResetUploadRuntimeState();
            }
        }
#endif
        /* The final clean status log is emitted below.  Avoid an extra
         * user-visible UI log here.
         */
        if (g_esp_ready && g_report_enabled) {
#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
            if (ESP_SPI_FullControlBusy()) {
                ESP_SPI_QueueReportModeSync(full);
            } else {
                if (g_spi_full_waiting_result == 0U) {
                    ESP_SPI_FullResetUploadRuntimeState();
                }
                if (!ESP32_SPI_StartReport(full, 3000U)) {
                    ESP_Log("[ESP32SPI] report mode sync failed: %s\r\n", mode_text);
                }
            }
#else
            if (!ESP32_SPI_StartReport(full, 3000U)) {
                ESP_Log("[ESP32SPI] report mode sync failed: %s\r\n", mode_text);
            }
#endif
        }
        server_cmd_applied = 1U;
    }

