lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/EdgeComm/edge_comm.c
}


/**
 * @brief  Data upload entry point.
 * @note   Summary and full-frame uploads are sent through the ESP32 SPI protocol.
 */
void ESP_Post_Data(void)
{
    if (g_esp_ready == 0) {
#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
        (void)ESP_SPI_FullClearBlockedTxState("post_not_ready", 1U);
#endif
        return;
    }

#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
    ESP_SPI_ServiceDeferredSync();
    (void)ESP_SPI_FullClearStaleWaitState("post");
    {
    static uint32_t last_full_send_time = 0;
    static uint32_t full_try = 0, full_ok = 0, full_err = 0;
    static uint32_t last_full_log = 0;
    static uint32_t last_not_armed_log = 0;
    static uint32_t last_no_snapshot_log = 0;
    static uint32_t s_full_frame_id = 0;
    uint32_t now_tick = HAL_GetTick();
    uint32_t min_itv = ESP_CommParams_MinIntervalMs();
    uint8_t packets_sent = 0U;
    bool ok = true;

    if (g_spi_full_waiting_result != 0U) {
        int32_t http_status = 0;
        int32_t result_code = ESP32_SPI_RESULT_PENDING;
        uint32_t result_frame_id = 0U;

        if ((HAL_GetTick() - g_spi_full_result_last_poll_tick) >= ESP32_SPI_FULL_RESULT_POLL_MS) {
            g_spi_full_result_last_poll_tick = HAL_GetTick();
            (void)ESP32_SPI_PollEvents(20U);
        }
        {
            const esp32_spi_status_t *st = ESP32_SPI_GetStatus();
            if (st != NULL &&
                g_spi_full_result_session_epoch != 0U &&
                st->session_epoch != 0U &&
                st->session_epoch != g_spi_full_result_session_epoch) {
                ESP_Log("[ESP32SPI] full wait abort: ESP32 session changed frame=%lu ref=%lu old=%lu new=%lu\r\n",
                        (unsigned long)g_spi_full_result_frame_id,
                        (unsigned long)g_spi_full_result_ref_seq,
                        (unsigned long)g_spi_full_result_session_epoch,
                        (unsigned long)st->session_epoch);
                ESP_SPI_FullClearWaitState();
                if (g_spi_full_timeout_count < 1000000UL) {
                    g_spi_full_timeout_count++;
                }
                ESP_UI_ScheduleAutoRecover("ESP32 session changed during full wait", 1U);
                ESP_SPI_FullEnterHoldoff("full wait session changed",
                                         ESP32_SPI_FULL_TIMEOUT_HOLDOFF_MS);
                return;
            }
        }
        if (ESP32_SPI_GetTxResult(g_spi_full_result_ref_seq,
                                  &http_status,
                                  &result_code,
                                  &result_frame_id)) {
            uint32_t done_elapsed = HAL_GetTick() - g_spi_full_result_start_tick;
            ESP_Log("[ESP32SPI] full http done frame=%lu ref=%lu elapsed=%lums http=%ld result=%ld\r\n",
                    (unsigned long)result_frame_id,
                    (unsigned long)g_spi_full_result_ref_seq,
                    (unsigned long)done_elapsed,
                    (long)http_status,
                    (long)result_code);
            ESP_SPI_FullClearWaitState();
            /* The ESP32 cloud task can queue SERVER_COMMAND immediately after
               REPORT_RESULT for the same HTTP response.  If we stop polling as
               soon as TX_RESULT arrives, the command event can remain stuck in
               the ESP32->STM32 queue until some unrelated status poll happens.
               Drain a few follow-up events right here so cloud commands become
               visible to the main loop in the next iteration instead of minutes
               later. */
            for (uint8_t drain = 0U; drain < 3U; ++drain) {
                if (!ESP32_SPI_PollEvents(20U)) {
                    break;
                }
            }
            if (result_code == ESP32_SPI_RESULT_OK && http_status >= 200 && http_status < 300) {
                g_spi_full_holdoff_until_tick = 0U;
                g_spi_full_timeout_count = 0U;
                g_spi_full_busy_nack_count = 0U;
                g_spi_full_http_fail_count = 0U;
            } else {
                if (g_spi_full_http_fail_count < 1000000UL) {
                    g_spi_full_http_fail_count++;
                }
                ESP_SPI_FullEnterHoldoff("full http result failed",
                                         ESP32_SPI_FULL_HTTP_FAIL_HOLDOFF_MS);
            }
            if (g_spi_full_manual_frames == 0U && g_spi_full_continuous == 0U) {
                ESP_SetServerReportMode(0U);
            }
        } else {
            uint32_t wait_elapsed = HAL_GetTick() - g_spi_full_result_start_tick;
            if (wait_elapsed >= ESP32_SPI_FULL_RESULT_TIMEOUT_MS) {
                ESP_Log("[ESP32SPI] full http timeout frame=%lu ref=%lu elapsed=%lums\r\n",
                        (unsigned long)g_spi_full_result_frame_id,
                        (unsigned long)g_spi_full_result_ref_seq,
                        (unsigned long)wait_elapsed);
                ESP_SPI_FullClearWaitState();
                if (g_spi_full_timeout_count < 1000000UL) {
                    g_spi_full_timeout_count++;
                }
                ESP_SPI_FullEnterHoldoff("full http timeout",
                                         ESP32_SPI_FULL_TIMEOUT_HOLDOFF_MS * g_spi_full_timeout_count);
                if (g_spi_full_manual_frames == 0U && g_spi_full_continuous == 0U) {
                    ESP_SetServerReportMode(0U);
                }
            } else if ((HAL_GetTick() - g_spi_full_result_last_log_tick) >= ESP32_SPI_FULL_WAIT_LOG_MS) {
                g_spi_full_result_last_log_tick = HAL_GetTick();
                ESP_Log("[ESP32SPI] full waiting http frame=%lu ref=%lu elapsed=%lums\r\n",
                        (unsigned long)g_spi_full_result_frame_id,
                        (unsigned long)g_spi_full_result_ref_seq,
                        (unsigned long)wait_elapsed);
            }
        }
        return;
    }

    if (g_full_tx_sm.active == 0U) {
        if (ESP_SPI_FullHoldoffActive(now_tick)) {
            (void)ESP32_SPI_PollEvents(20U);
            return;
        }

        const ESP_UploadSnapshot_t *snapshot;
        uint32_t snapshot_seq = 0U;
        uint8_t one_shot = 0U;

        if (min_itv && (now_tick - last_full_send_time < min_itv)) {
            return;
        }

        if (g_spi_full_continuous == 0U) {
            if (g_spi_full_manual_frames == 0U) {
                if ((now_tick - last_not_armed_log) >= ESP32_SPI_FULL_NOT_ARMED_LOG_MS) {
                    last_not_armed_log = now_tick;
                    ESP_Log("[ESP32SPI] full requested but not armed; type full1/full10/fullon on STM32 console.\r\n");
                }
                return;
            }
            one_shot = 1U;
        }

        snapshot = ESP_UploadSnapshot_TryAcquireLatest(&snapshot_seq);
        if (snapshot == NULL) {
            if ((now_tick - last_no_snapshot_log) >= 2000U) {
                last_no_snapshot_log = now_tick;
                ESP_Log("[ESP32SPI] full waiting DSP snapshot pub=%lu drop=%lu inflight=%d latest=%d\r\n",
                        (unsigned long)g_upload_snapshot_publish_count,
                        (unsigned long)g_upload_snapshot_drop_count,
                        (int)g_upload_snapshot_inflight_idx,
                        (int)g_upload_snapshot_latest_idx);
            }
            return;
        }

        if (!ESP_FullTx_StartFrame(++s_full_frame_id, snapshot, snapshot_seq, one_shot)) {
            ESP_UploadSnapshot_Release(snapshot_seq);
            full_err++;
            ESP_Log("[ESP32SPI] full start failed snapshot=%lu err=%lu\r\n",
                    (unsigned long)snapshot_seq,
                    (unsigned long)full_err);
            return;
        }
        if (one_shot != 0U && g_spi_full_manual_frames > 0U) {
            g_spi_full_manual_frames--;
        }
        full_try++;
        last_full_send_time = now_tick;
    }

