lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/EdgeComm/edge_comm.c
    while (g_full_tx_sm.active != 0U && packets_sent < ESP32_SPI_FULL_PACKETS_PER_POLL) {
        ok = ESP_FullTx_StepPacket(ESP32_SPI_FULL_PACKET_ACCEPT_TIMEOUT_MS);
        if (!ok) {
            break;
        }
        packets_sent++;
        if (ESP32_SPI_FULL_YIELD_EVERY > 0U &&
            (packets_sent % ESP32_SPI_FULL_YIELD_EVERY) == 0U) {
            ESP_RtosYield();
        }
    }

    if (!ok) {
        uint32_t failed_frame = g_full_tx_sm.frame_id;
        uint32_t elapsed_ms = HAL_GetTick() - g_full_tx_sm.start_tick;
        uint8_t one_shot_failed = g_full_tx_sm.one_shot;
        uint8_t phase_failed = (uint8_t)g_full_tx_sm.phase;
        uint16_t nack_reason = ESP32_SPI_GetLastNackReason();
        full_err++;
        ESP_Log("[ESP32SPI] full tx fail frame=%lu elapsed=%lums pkt=%lu phase=%u try=%lu ok=%lu err=%lu snapshot=%lu drop=%lu nack=%u\r\n",
                (unsigned long)failed_frame,
                (unsigned long)elapsed_ms,
                (unsigned long)g_full_tx_sm.packet_count,
                (unsigned int)g_full_tx_sm.phase,
                (unsigned long)full_try,
                (unsigned long)full_ok,
                (unsigned long)full_err,
                (unsigned long)g_full_tx_sm.snapshot_seq,
                (unsigned long)g_upload_snapshot_drop_count,
                (unsigned int)nack_reason);
        if (nack_reason == ESP32_SPI_NACK_INVALID_STATE) {
            ESP_SPI_ResetLocalReportState("full NACK invalid_state");
        } else if (nack_reason == ESP32_SPI_NACK_BUSY ||
                   (phase_failed == (uint8_t)ESP_FULL_TX_BEGIN &&
                    nack_reason == ESP32_SPI_NACK_INVALID_PAYLOAD)) {
            if (g_spi_full_busy_nack_count < 1000000UL) {
                g_spi_full_busy_nack_count++;
            }
            ESP_FullTx_ClearAndRelease();
            ESP_SPI_FullEnterHoldoff((nack_reason == ESP32_SPI_NACK_BUSY) ?
                                     "full NACK busy" : "full begin NACK invalid_payload",
                                     ESP32_SPI_FULL_BUSY_HOLDOFF_MS * g_spi_full_busy_nack_count);
        } else {
            ESP_FullTx_ClearAndRelease();
        }
        if (one_shot_failed != 0U && g_spi_full_manual_frames == 0U && g_spi_full_continuous == 0U) {
            ESP_SetServerReportMode(0U);
        }
        return;
    }

    if (g_full_tx_sm.active == 0U) {
        uint32_t done_frame = g_full_tx_sm.frame_id;
        uint32_t done_seq = g_full_tx_sm.snapshot_seq;
        uint32_t done_packets = g_full_tx_sm.packet_count;
        uint32_t done_wave_step = g_full_tx_sm.wave_step;
        uint32_t done_upload_points = g_full_tx_sm.upload_points;
        uint16_t done_wave_points = (g_full_tx_sm.channel_count > 0U) ?
                                    g_full_tx_sm.channels[0].waveform_count : 0U;
        uint32_t elapsed_ms = HAL_GetTick() - g_full_tx_sm.start_tick;
        uint32_t done_ref_seq = ESP32_SPI_GetLastFullEndRefSeq();
        uint32_t last_nack_ref = ESP32_SPI_GetLastNackRefSeq();
        uint16_t last_nack_reason = ESP32_SPI_GetLastNackReason();
        full_ok++;
        g_spi_full_busy_nack_count = 0U;
        ESP_UploadSnapshot_Release(done_seq);
        memset(&g_full_tx_sm, 0, sizeof(g_full_tx_sm));

        if (done_ref_seq == 0U ||
            (last_nack_ref == done_ref_seq && last_nack_reason == ESP32_SPI_NACK_INVALID_STATE)) {
            full_err++;
            ESP_Log("[ESP32SPI] full end ref rejected frame=%lu ref=%lu nack_ref=%lu reason=%u elapsed=%lums; skip http wait\r\n",
                    (unsigned long)done_frame,
                    (unsigned long)done_ref_seq,
                    (unsigned long)last_nack_ref,
                    (unsigned int)last_nack_reason,
                    (unsigned long)elapsed_ms);
            ESP_SPI_FullEnterHoldoff("full end ref rejected",
                                     ESP32_SPI_FULL_BUSY_HOLDOFF_MS);
            return;
        }

        g_spi_full_waiting_result = 1U;
        g_spi_full_result_ref_seq = done_ref_seq;
        g_spi_full_result_frame_id = done_frame;
        g_spi_full_result_start_tick = HAL_GetTick();
        {
            const esp32_spi_status_t *st = ESP32_SPI_GetStatus();
            g_spi_full_result_session_epoch = (st != NULL) ? st->session_epoch : 0U;
        }
        g_spi_full_result_last_log_tick = g_spi_full_result_start_tick;
        g_spi_full_result_last_poll_tick = 0U;

        if ((HAL_GetTick() - last_full_log) >= 1000U) {
            last_full_log = HAL_GetTick();
            ESP_Log("[ESP32SPI] full tx done frame=%lu snap=%lu elapsed=%lums pkt=%lu try=%lu ok=%lu err=%lu step=%lu upload_points=%lu wave=%u fft=%u drop=%lu\r\n",
                    (unsigned long)done_frame,
                    (unsigned long)done_seq,
                    (unsigned long)elapsed_ms,
                    (unsigned long)done_packets,
                    (unsigned long)full_try,
                    (unsigned long)full_ok,
                    (unsigned long)full_err,
                    (unsigned long)done_wave_step,
                    (unsigned long)done_upload_points,
                    (unsigned int)done_wave_points,
                    (unsigned int)FFT_POINTS,
                    (unsigned long)g_upload_snapshot_drop_count);
        }
    } else if ((HAL_GetTick() - last_full_log) >= 1000U) {
        last_full_log = HAL_GetTick();
        ESP_Log("[ESP32SPI] full tx progress frame=%lu snap=%lu phase=%u ch=%u off=%u pkt=%lu drop=%lu\r\n",
                (unsigned long)g_full_tx_sm.frame_id,
                (unsigned long)g_full_tx_sm.snapshot_seq,
                (unsigned int)g_full_tx_sm.phase,
                (unsigned int)g_full_tx_sm.channel_index,
                (unsigned int)g_full_tx_sm.element_offset,
                (unsigned long)g_full_tx_sm.packet_count,
                (unsigned long)g_upload_snapshot_drop_count);
    }
    return;
    }
#else
    static uint32_t last_full_log = 0;
    uint32_t now_full = HAL_GetTick();
    if ((now_full - last_full_log) >= 2000U) {
        last_full_log = now_full;
        ESP_Log("[ESP32SPI] full report over SPI disabled; summary path remains active.\r\n");
    }
    return;
#endif
}


