lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/EdgeComm/edge_comm.c
#if (ESP32_SPI_STRESS_TEST)
    p.min_interval_ms = ESP32_SPI_STRESS_SENDLIMIT_MS;
#if (ESP32_SPI_STRESS_FULL_UPLOAD)
    /* Keep lightweight idle heartbeats below server NODE_TIMEOUT as a fallback
       if full-frame uploads are backing off or waiting for recovery. */
    p.heartbeat_ms = ESP32_SPI_FULL_IDLE_HEARTBEAT_MS;
    g_server_report_full = 1U;
    g_server_report_full_dirty = 0U;
#endif
    ESP_CommParams_Apply(&p);
#endif

    if (!ESP_Config_IsValidForLink(cfg)) {
        ESP_Log("[ESP32SPI] config invalid: ssid/server/node is empty.\r\n");
        return false;
    }

    ESP_Log("[ESP32SPI] config ssid=%s server=%s:%u node=%s\r\n",
            cfg->wifi_ssid,
            cfg->server_ip,
            (unsigned int)cfg->server_port,
            cfg->node_id);
#if (ESP32_SPI_STRESS_TEST)
    ESP_Log("[ESP32SPI] stress test: spi=%s sendlimit=%lums mode=%s\r\n",
            ESP32_SPI_STRESS_SPI_LABEL,
            (unsigned long)p.min_interval_ms,
            ESP32_SPI_STRESS_FULL_UPLOAD ? "full" : "summary");
#endif

    if (!ESP32_SPI_ApplyDeviceConfig(cfg->wifi_ssid,
                                     cfg->wifi_password,
                                     cfg->server_ip,
                                     cfg->server_port,
                                     cfg->node_id,
                                     cfg->node_location,
                                     "STM32H750_ESP32_SPI")) {
        ESP_Log("[ESP32SPI] apply device config failed.\r\n");
        return false;
    }

    if (!ESP32_SPI_ApplyCommParams(p.heartbeat_ms,
                                   p.min_interval_ms,
                                   p.http_timeout_ms,
                                   3000U,
                                   p.wave_step,
                                   p.upload_points,
                                   p.hardreset_sec,
                                   p.chunk_kb,
                                   p.chunk_delay_ms)) {
        ESP_Log("[ESP32SPI] apply comm params failed.\r\n");
        return false;
    }

    return true;
}

static void ESP_UI_SPI_LogStatus(const char *prefix)
{
    const esp32_spi_status_t *st = ESP32_SPI_GetStatus();
    ESP_Log("[ESP32SPI] %s ready=%u wifi=%u cloud=%u reg=%u report=%u mode=%u ip=%s err=%s\r\n",
            prefix ? prefix : "status",
            (unsigned int)st->ready,
            (unsigned int)st->wifi_connected,
            (unsigned int)st->cloud_connected,
            (unsigned int)st->registered_with_cloud,
            (unsigned int)st->reporting_enabled,
            (unsigned int)st->report_mode,
            st->ip_address,
            st->last_error);
}

static bool ESP_UI_DoApplyConfig(void)
{
    ESP_Log("[UI] Applying saved SD config to ESP32...\r\n");
    if (g_report_enabled) {
        ESP_Log("[UI] Apply config denied: reporting active, stop/reconnect first.\r\n");
        return false;
    }
    if (!ESP32_SPI_EnsureReady(5000U)) {
        ESP_Log("[ESP32SPI] ESP32 not ready for config apply.\r\n");
        return false;
    }
    if (!ESP_UI_SPI_LoadAndApplyConfig()) {
        return false;
    }
    g_esp_ready = 0;
    g_ui_wifi_ok = 0;
    g_ui_tcp_ok = 0;
    g_ui_reg_ok = 0;
    (void)ESP32_SPI_QueryStatus(NULL, 500U);
    ESP_UI_SPI_LogStatus("config applied");
    ESP_Log("[UI] Saved SD config applied. Re-run WiFi/TCP/REG/Report if needed.\r\n");
    return true;
}

static bool ESP_UI_WaitForWifiConnected(uint32_t timeout_ms)
{
    uint32_t start = HAL_GetTick();
    esp32_spi_status_t st;

    do {
        if (ESP32_SPI_QueryStatus(&st, 1000U)) {
            ESP_UI_SyncLinkFlagsFromStatus(&st);
            if (st.wifi_connected) {
                return true;
            }
        }
        if (osKernelGetState() == osKernelRunning && __get_IPSR() == 0U) {
            osDelay(ESP32_SPI_WIFI_STATUS_POLL_MS);
        }
    } while ((HAL_GetTick() - start) < timeout_ms);

    ESP_UI_SPI_LogStatus("wifi failed");
    return false;
}

static bool ESP_UI_DoWiFi(void)
{
    bool connect_resp_ok;

    ESP_Log("[UI] Executing WIFI via ESP32 SPI...\r\n");
    g_esp_ready = 0;
    g_report_enabled = 0;
    g_ui_wifi_ok = 0;
    g_ui_tcp_ok = 0;
    g_ui_reg_ok = 0;
#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
    ESP_SPI_FullResetUploadRuntimeState();
#endif

    if (!ESP32_SPI_EnsureReady(5000U)) {
        ESP_Log("[ESP32SPI] ESP32 not ready.\r\n");
        return false;
    }
    if (!ESP_UI_SPI_LoadAndApplyConfig()) {
        return false;
    }
    connect_resp_ok = ESP32_SPI_ConnectWifi(30000U);
    if (!ESP_UI_WaitForWifiConnected(ESP32_SPI_WIFI_CONNECT_SETTLE_MS)) {
        g_ui_wifi_ok = 0;
        return false;
    }
    if (!connect_resp_ok) {
        ESP_Log("[ESP32SPI] wifi connect response missed, but status is connected; continue.\r\n");
    }

    g_ui_wifi_ok = 1;
    ESP_UI_SPI_LogStatus("wifi ok");
    return true;
}

static bool ESP_UI_DoTCP(void)
{
    esp32_spi_status_t st;
    ESP_Log("[UI] Executing TCP via ESP32 SPI...\r\n");

    if (!ESP32_SPI_QueryStatus(&st, 1000U) || !st.wifi_connected) {
        ESP_Log("[ESP32SPI] TCP denied: WiFi not connected.\r\n");
        g_ui_tcp_ok = 0;
        return false;
    }
    if (!ESP32_SPI_CloudConnect(5000U)) {
        if (!ESP32_SPI_QueryStatus(&st, 1000U) ||
            (!st.cloud_connected && !st.registered_with_cloud && !st.reporting_enabled)) {
            ESP_UI_SPI_LogStatus("tcp/cloud failed");
            g_ui_tcp_ok = 0;
            return false;
        }
        ESP_Log("[ESP32SPI] cloud connect response missed, but status is already active; continue.\r\n");
    }
    g_ui_tcp_ok = 1;
    ESP_UI_SPI_LogStatus("tcp/cloud ok");
    return true;
}

static bool ESP_UI_DoRegister(void)
{
    esp32_spi_status_t st;
    ESP_Log("[UI] Executing REG via ESP32 SPI...\r\n");

    if (!ESP32_SPI_QueryStatus(&st, 1000U) || !st.wifi_connected) {
        ESP_Log("[ESP32SPI] REG denied: WiFi not connected.\r\n");
        g_ui_reg_ok = 0;
        return false;
    }
    if (!g_ui_tcp_ok) {
        ESP_Log("[ESP32SPI] REG denied: TCP/cloud step not completed.\r\n");
        g_ui_reg_ok = 0;
        return false;
    }
    if (!ESP32_SPI_RegisterNode(20000U)) {
        ESP_UI_SPI_LogStatus("register failed");
        g_ui_reg_ok = 0;
        return false;
    }

    ESP_Init_Channels_And_DSP();
    g_esp_ready = 1;
    g_ui_reg_ok = 1;
#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
    ESP_SPI_FullResetUploadRuntimeState();
#endif
    ESP_UI_SPI_LogStatus("register ok");
    {
        esp32_spi_status_t st;
        if (ESP32_SPI_QueryStatus(&st, 500U)) {
            if (st.reporting_enabled) {
                ESP_Log("[ESP32SPI] clearing residual ESP32 reporting state after REG.\r\n");
                (void)ESP32_SPI_StopReport(3000U);
            }
            g_report_enabled = 0U;
        } else {
            g_report_enabled = 0U;
        }
    }
#if (ESP32_SPI_STRESS_FULL_UPLOAD && ESP32_SPI_ENABLE_FULL_UPLOAD)
    ESP_SetServerReportMode(1U);
    g_spi_full_continuous = 1U;
    if (ESP32_SPI_StartReport(1U, 3000U)) {
        g_report_enabled = 1U;
        (void)ESP_AutoReconnect_SetLastReporting(true);
        ESP_Log("[ESP32SPI] forced full continuous report armed after REG.\r\n");
    } else {
        ESP_UI_SPI_LogStatus("force full start report failed");
    }
#endif
    ESP_Log("[ESP32SPI] registration complete, SPI link ready.\r\n");
    return true;
}

static bool ESP_UI_ToggleReport(void)
{
    if (!g_report_enabled)
    {
        uint8_t mode = ESP_ServerReportFull() ? 1U : 0U;
        if (!g_esp_ready)
        {
            ESP_Log("[UI] Report denied: link not ready (need REG first)\r\n");
            return false;
        }
        if (!ESP_UI_EnsureReportStarted(mode, "start report failed")) {
            return false;
        }
        ESP_Log("[UI] Started ESP32 SPI data upload loop.\r\n");
        return true;
    }
    else
    {
        if (!ESP32_SPI_StopReport(3000U)) {
            esp32_spi_status_t st;
            if (!ESP32_SPI_QueryStatus(&st, 1000U) || st.reporting_enabled) {
                ESP_UI_SPI_LogStatus("stop report failed");
                return false;
            }
            ESP_Log("[ESP32SPI] stop response missed, but status is stopped; continue.\r\n");
        }
        g_report_enabled = 0U;
#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
        ESP_SPI_FullResetUploadRuntimeState();
#endif
        ESP_Log("[UI] Data upload stopped.\r\n");
        (void)ESP_AutoReconnect_SetLastReporting(false);
        return true;
    }
}

static void ESP_UI_AutoConnect(void)
{
    ESP_Log("[UI] Auto sequence started...\r\n");
    bool ok_wifi = ESP_UI_DoWiFi();
    esp_ui_step_done(ESP_UI_CMD_WIFI, ok_wifi);
    if (!ok_wifi)
        return;

    bool ok_tcp = ESP_UI_DoTCP();
    esp_ui_step_done(ESP_UI_CMD_TCP, ok_tcp);
    if (!ok_tcp)
        return;

    bool ok_reg = ESP_UI_DoRegister();
    esp_ui_step_done(ESP_UI_CMD_REG, ok_reg);
    if (!ok_reg)
        return;

    if (!g_report_enabled)
    {
        if (!ESP_UI_ToggleReport()) {
            esp_ui_step_done(ESP_UI_CMD_REPORT_TOGGLE, false);
            return;
        }
    }
    else if (!ESP_UI_EnsureReportStarted(ESP_ServerReportFull() ? 1U : 0U,
                                         "auto connect start report failed")) {
        esp_ui_step_done(ESP_UI_CMD_REPORT_TOGGLE, false);
        return;
    }
    esp_ui_step_done(ESP_UI_CMD_REPORT_TOGGLE, true);
}

